define({
	"DIGITS": "{0}只能输入数字", 
	"LETTERS": "{0}只能输入字母",
	"EMAIL": "邮箱格式不正确",
	"PHONE": "电话格式不正确!",
	"DATE": "请输入正确的日期, 例:yyyy-mm-dd",
	"TIME": "请输入正确的时间,例:14:30或14:30:00",
	"DATETIME": "请输入正确的日期时间, 例：2013-01-01 14:30:00",
	"URL": "网址格式不正确",
	"USERNAME": "请输入3-12位数字、字母、下划线",
	"PASSWORD": "密码由6-16位数字、字母组成",
	"MONEY": "请输入1-8位数金额,可保留两位小数!",
	"DISCOUNT": "请输入0-100的整数",
	
	"ACCEPT": "{0}只接受{1}后缀",
	"REQUIRED": "{0}不能为空",
	
	"INTEGER_*": "请输入整数",
	"INTEGER_+": "请输入正整数",
	"INTEGER_+0": "请输入正整数或0",
	"INTEGER_-": "请输入负整数",
	"INTEGER_-0": "请输入负整数或0",
	
	"RANGE_RG": "请输入{1}到{2}的数",
	"RANGE_GT": "请输入大于或等于{1}的数",
	"RANGE_LT": "请输入小于或等于{1}的数",
	
	"CHECKED_EQ": "Please select {1}",
	"CHECKED_RG": "请选择{1}到{2}项",
	"CHECKED_GT": "请至少选择{1}项",
	"CHECKED_LT": "请最多选择{1}项",
	
	"LENGTH_EQ": "请输入{1}个字符",
	"LENGTH_RG": "请输入{1}到{2}个字符",
	"LENGTH_GT": "请输入大于{1}个字符",
	"LENGTH_LT": "请输入小于{1}个字符",
	"LENGTH_2_EQ": "请输入{1}个字符, 中文算双字符",
	"LENGTH_2_RG": "请输入{1}到{2}个字符, 中文算双字符",
	"LENGTH_2_GT": "请输入大于{1}个字符, 中文算双字符",
	"LENGTH_2_LT": "请输入小于{1}个字符, 中文算双字符", 
	
	"DEFAULT_ERROR_MSG": "{0}格式不正确"
});